In [1]:
import pandas as pd
pd.__version__

'1.4.4'

### 판다스는 벡터연산에 최적화 되어있다.
- 테이블형태의 데이터 사용 
- 엑셀이 제공하는 연산기능을 거의다 제공
- 각종 데이터 파싱가능

In [3]:
#데이터분석 사용 라이브러리 4가지
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
# s는 1,3,5,6,8을 원소로 가지는 series
pd.Series([1,3,5,6,8])

0    1
1    3
2    5
3    6
4    8
dtype: int64

In [8]:
# 12x4 행렬에 1부터 48까지 숫자를 원소를 가지고, index는 0부터시작하는 그리고 칼럼은 x1,x2...
df = pd.DataFrame(data=np.arange(1,49).reshape(12,4), columns=["X1","X2","X3","X4"])

In [9]:
df

    X1  X2  X3  X4
0    1   2   3   4
1    5   6   7   8
2    9  10  11  12
3   13  14  15  16
4   17  18  19  20
5   21  22  23  24
6   25  26  27  28
7   29  30  31  32
8   33  34  35  36
9   37  38  39  40
10  41  42  43  44
11  45  46  47  48

In [10]:
#dataframe index
df.index

RangeIndex(start=0, stop=12, step=1)

In [11]:
#dataframe columns
df.columns

Index(['X1', 'X2', 'X3', 'X4'], dtype='object')

In [12]:
#dataframe values
df.values

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16],
       [17, 18, 19, 20],
       [21, 22, 23, 24],
       [25, 26, 27, 28],
       [29, 30, 31, 32],
       [33, 34, 35, 36],
       [37, 38, 39, 40],
       [41, 42, 43, 44],
       [45, 46, 47, 48]])

In [14]:
#특정칼럼을 가져오기
df["X1"]

0      1
1      5
2      9
3     13
4     17
5     21
6     25
7     29
8     33
9     37
10    41
11    45
Name: X1, dtype: int32

In [15]:
#X1 칼럼에 2더하기
df["X1"]+2

0      3
1      7
2     11
3     15
4     19
5     23
6     27
7     31
8     35
9     39
10    43
11    47
Name: X1, dtype: int32

In [16]:
#DF의 맨 위 다섯줄을 보여주는 HEAD()
df.head()

   X1  X2  X3  X4
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20

In [17]:
# df 요약정보(index,colums,null)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X1      12 non-null     int32
 1   X2      12 non-null     int32
 2   X3      12 non-null     int32
 3   X4      12 non-null     int32
dtypes: int32(4)
memory usage: 320.0 bytes

In [18]:
#dataframe에 대한 전체적인 통계정보
df.describe()

              X1         X2         X3         X4
count  12.000000  12.000000  12.000000  12.000000
mean   23.000000  24.000000  25.000000  26.000000
std    14.422205  14.422205  14.422205  14.422205
min     1.000000   2.000000   3.000000   4.000000
25%    12.000000  13.000000  14.000000  15.000000
50%    23.000000  24.000000  25.000000  26.000000
75%    34.000000  35.000000  36.000000  37.000000
max    45.000000  46.000000  47.000000  48.000000

In [20]:
#x2칼럼 기준으로 내림차순 정렬
df.sort_values(by='X2', ascending=False)

    X1  X2  X3  X4
11  45  46  47  48
10  41  42  43  44
9   37  38  39  40
8   33  34  35  36
7   29  30  31  32
6   25  26  27  28
5   21  22  23  24
4   17  18  19  20
3   13  14  15  16
2    9  10  11  12
1    5   6   7   8
0    1   2   3   4

In [21]:
#df indexing 및 slicing
df[0:3]

   X1  X2  X3  X4
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12

In [22]:
#index value를 기준으로 indexing도 가능
# 두번째 row but list와 다르다.
df.loc[1]

X1    5
X2    6
X3    7
X4    8
Name: 1, dtype: int32

In [23]:
#df.loc로 특정값을 인덱싱하는ㅇ방법
df.loc[0]

X1    1
X2    2
X3    3
X4    4
Name: 0, dtype: int32

In [25]:
df.loc[0]["X3"]

3

In [29]:
#df.loc에 2차원 indexing도 가능
#df.loc["row에 대한 조건",col에 대한 조건]
df.loc[4,"X2"]
df.loc[[0,3],["X1","X3"]]
df.loc[0:4,"X1":"X3"] #LOC로 슬라이싱하며ㅓㄴ 모든범위가 포함됨

   X1  X2  X3
0   1   2   3
1   5   6   7
2   9  10  11
3  13  14  15
4  17  18  19

In [34]:
# boolean mask == filter
mask = df["X1"]>10 # row에 대한 조건으로 뽑는다.
mask
df.loc[mask]

#df에서 x2 column이 20이상인 모든 데이터를 출력
mask2 = df['X2']>=20
df.loc[mask2]

#df에서 x2 칼럼이 20이상인 x4를 출력
mask3 = df['X3']>=20
df.loc[mask3,"X4"]

5     24
6     28
7     32
8     36
9     40
10    44
11    48
Name: X4, dtype: int32

In [39]:
#X3칼럼에서 10이상 30이하인 데이터를 추출하시오 &(교집합)쓸때는 반드시 양쪽에 괄호씌어주기
mask4 = (10<=df["X3"]) & (df["X3"]<=30)
df.loc[mask4,"X3"]


#X2칼럼에서 10보다 작거나 30보다 큰 데이터를 추출하시오
mask5 = (df["X2"]<10)|(df["X2"]>30)
df.loc[mask5]

    X1  X2  X3  X4
0    1   2   3   4
1    5   6   7   8
8   33  34  35  36
9   37  38  39  40
10  41  42  43  44
11  45  46  47  48

In [40]:
#iloc로 인덱스슬라이싱 가능(조건은 안된다)
df.iloc[2:8,0:3]

   X1  X2  X3
2   9  10  11
3  13  14  15
4  17  18  19
5  21  22  23
6  25  26  27
7  29  30  31